content/topics/autonomy_supportive_coaching.md
+++
title = "Autonomy-supportive coaching"
author = ["Dorneanu"]
tags = ["psychology", "productivity"]
draft = false
+++

## Overview {#overview}

Autonomy-supportive coaching is a leadership and coaching style that gradually transfers control, decision-making, and responsibility to the athlete or learner, rather than maintaining authority in the coach. Research consistently shows that control-based coaching produces effort only when the coach is present, while autonomy-supportive coaching builds intrinsic motivation, self-belief, confidence, and resilience that persists when the coach is absent. The goal of autonomy-supportive coaching is to make the coach progressively obsolete — not by abandoning the learner, but by shifting from director to guide, mentor, and co-pilot.


## Core principles {#core-principles}

-   **Gradual transfer of control**: Start with precise guidance; over time introduce collaborative questions ("What do you think? What would you do?"), then hand over actual decision-making
-   **Goal: independence, not dependence**: The athlete should eventually be the one steering the ship
-   **Internal conversation matters**: Kobe Bryant's insight — when an athlete is in a difficult moment, they are having an internal conversation with themselves. An external voice interrupts that process. "Let her be. Let her figure it out herself."
-   **Manageable challenges**: Assign tasks just beyond current capability to build capacity without overwhelming


## Why it works {#why-it-works}

-   Human brains and bodies are designed to be stressed appropriately — like a muscle needs resistance to grow
-   Intrinsic motivation, once built, is self-sustaining
-   Athletes who develop internal locus of control continue training without external enforcement
-   Effort and agency are linked: if the brain calculates that everything is risky or pointless, it defaults to "why try mode"


## Application to parenting {#application-to-parenting}

The same principles apply to parenting. Always rescuing children from hard problems or mediating their conflicts prevents the development of the exact skills needed when no adult is present. The "thousand small acts of judgment" — navigating conflict, assessing risk, making decisions — must be practiced to be learned.

See also: [Free-Range Parenting]({{< relref "free_range_parenting.md" >}}), [Safetyism]({{< relref "safetyism.md" >}})


## Resources {#resources}

-   2026-05-19 ◦ [The Cost of Safetyism — Steve Magness](https://stevemagness.substack.com/p/the-cost-of-safetyism) — uses coaching experience to argue that autonomy-supportive approaches produce resilience while control-based approaches produce dependence
